AOS.init({
    duration: 1500
});
document.addEventListener('DOMContentLoaded', function() {
    const burgerMenu = document.getElementById('burger-menu');
    const mobileNav = document.querySelector('.mobile-nav');

    burgerMenu.addEventListener('click', function() {
        mobileNav.classList.toggle('active');
    });
});

document.addEventListener('DOMContentLoaded', function() {
    translate()
}, false);

const lgConfig = {
    ru: {
        title: 'КГУ «Опорная школа (ресурсный центр) имени Ахмета Байтурсынулы»',
        name: 'КГУ Опорная школа имени Ахмета Байтурсынулы',
        name_desc: 'Добро пожаловать в нашу школу, названную в честь великого казахского мыслителя и просветителя Ахмета Байтурсынулы. Основанная на принципах, которые он отстаивал, наша школа стремится воплотить его наследие через качественное образование и воспитание подрастающего поколения.', 
        about: 'О нас',
        education: 'Образование',
        news: 'Новости',
        events: 'Мероприятия',
        contacts: 'Контакты',
        quote: 'Мир спасёт образование',
        support_school: 'Опорная школа',
        support_school__deck: 'Oпорная школа (ресурсный центр) - организация общего среднего образования, на базе которой консолидируются образовательные ресурсы близлежащих малокомплектных школ для проведения краткосрочных сессионных занятий и промежуточной и итоговой аттестации обучающихся в целях обеспечения доступа к качественному образованию учащимся малокомплектных школ.',
        about_desc: 'Школа имени Ахмета Байтурсынова была основана с целью создания образовательного учреждения, которое бы не только предоставляло отличное академическое образование, но и способствовало развитию культурного и духовного наследия казахского народа. Мы гордимся своей богатой историей и традициями, которые вдохновляют нас каждый день.',
        our_team: 'Преподавательский состав',
        mission: 'Миссия',
        mission_desc: 'Наша миссия — обеспечить всестороннее развитие каждого учащегося,создавая условия для получения качественного образования, воспитания патриотизма,социальной ответственности и уважения к другим. Мы стремимся воспитать личностей, способных мыслить критически, действовать самостоятельно и эффективно сотрудничать в команде.',
        vision: 'Видение',
        vision_desc1: 'Мы видим нашу школу как современное образовательное учреждение, которое:',
        vision_desc2: 'Стимулирует учебный интерес и интеллектуальное развитие учащихся посредством инновационных методик и технологий.',
        vision_desc3: 'Обеспечивает безопасную и поддерживающую среду, где каждый ученик чувствует себя ценным и уважаемым членом школьного сообщества.',
        vision_desc4: 'Формирует лидеров будущего, готовых к вызовам и возможностям 21-го века.',
        vision_desc5: 'Сотрудничает с родителями и обществом, развивая партнерские отношения, которые способствуют успеху каждого учащегося.',
        vision_desc6: 'Мы убеждены, что через целенаправленное образование и воспитание наши ученики станут уверенными, компетентными и ответственными гражданами, способными вносить положительные изменения в мир.',
        graduates: 'Наши выпускники',
        graduates_desc1: 'Выпускники нашей школы имеют блестящие перспективы благодаря всестороннему и качественному образованию, полученному у нас. Мы гордимся тем, что наши учащиеся успешно поступают в престижные вузы, достигают значительных успехов в профессиональной сфере и становятся активными и ответственными гражданами.',
        graduates_desc2: 'Выпускники нашей школы уверенно смотрят в будущее, обладая необходимыми знаниями, навыками и ценностями для успешной реализации своих амбиций и целей в любом выбранном ими направлении.',
        ex: '',
    },
    en: {
        title: '"Ахмет Байтұрсынұлы атындағы тірек мектебі (ресурстық орталық)" КММ',
        name: '"Ахмет Байтұрсынұлы атындағы тірек мектебі" КММ',
        name_desc: 'Қазақтың ұлы ойшыл ағартушысы Ахмет Байтұрсынұлы атындағы мектебімізге қош келдіңіздер. Ол ұстанған ұстанымдар негізінде құрылған мектебіміз оның мұрасын келешек ұрпаққа сапалы білім мен тәрбие беру арқылы жалғастыруға ұмтылады.',
        about: 'Біз туралы',
        education: 'Білім',
        news: 'Жаңалықтар',
        events: 'Оқиғалар',
        contacts: 'Байланыстар',
        quote: 'Білім әлемді құтқарады',
        support_school: 'Қолдау мектебі',
        support_school__deck: 'Тірек мектеп (ресурстық орталық) – сапалы білімге қолжетімділікті қамтамасыз ету мақсатында қысқа мерзімді сессия сабақтарын және оқушылардың аралық және қорытынды аттестациясын өткізу үшін базасында жақын орналасқан шағын жинақты мектептердің білім беру ресурстары шоғырландырылған жалпы орта білім беру ұйымы. Шағын жинақты мектептердің оқушылары үшін.',
        about_desc: 'Ахмет Байтұрсынов мектебі тамаша академиялық білім беріп қана қоймай, қазақ халқының мәдени-рухани мұрасын дамытуға үлес қосатын оқу орнын құру мақсатымен құрылған. Біз күн сайын бізді шабыттандыратын бай тарихымыз бен дәстүрлерімізді мақтан тұтамыз.',
        our_team: 'Педагогикалық қызметкерлер',
        mission: 'Миссия',
        mission_desc: 'Біздің міндетіміз – әрбір оқушының жан-жақты дамуын қамтамасыз ету, сапалы білім алуына жағдай жасау, отансүйгіштікке, әлеуметтік жауапкершілікке, басқаларға құрметпен қарауға тәрбиелеу. Біз сыни тұрғыдан ойлай алатын, өз бетінше әрекет ететін және топтың бір бөлігі ретінде тиімді жұмыс істей алатын жеке тұлғаларды дамытуға тырысамыз.',
        vision: 'Көрініс',
        vision_desc1: 'Біз мектебімізді заманауи білім беру мекемесі ретінде көреміз:',
        vision_desc2: 'Инновациялық әдістер мен технологиялар арқылы оқушылардың білімге деген қызығушылығы мен интеллектуалдық дамуын ынталандырады.',
        vision_desc3: 'Әрбір оқушы өзін мектеп қауымдастығының құнды және құрметті мүшесі ретінде сезінетін қауіпсіз және қолдаушы ортаны қамтамасыз етеді.',
        vision_desc4: '21 ғасырдың сын-қатерлері мен мүмкіндіктеріне дайын болашақ көшбасшыларын жасайды.',
        vision_desc5: 'Әр оқушының жетістігіне ықпал ететін серіктестікті дамыту үшін ата-аналармен және қоғаммен ынтымақтасады.',
        vision_desc6: 'Мақсатты білім мен тәрбие арқылы оқушыларымыз әлемге оң өзгерістер енгізуге қабілетті, өзіне сенімді, білікті және саналы азамат болып шығады деп сенеміз.',
        graduates: 'Біздің түлектер',
        graduates_desc1: 'Бізден алған жан-жақты және сапалы білімнің арқасында мектебіміздің түлектерінің болашағы зор. Студенттеріміздің беделді жоғары оқу орындарына сәтті түсіп, елеулі кәсіби жетістіктерге жетіп, белсенді және саналы азамат болып қалыптасып жатқанын мақтан тұтамыз.',
        graduates_desc2: 'Біздің мектептің түлектері болашаққа сеніммен қарайды, олар таңдаған кез келген бағытта өздерінің амбициялары мен мақсаттарын сәтті жүзеге асыру үшін қажетті білім, дағдылар мен құндылықтарға ие.',
        ex: '',
    }
}

const russianBtn = document.querySelector('#russian-btn');
const englishBtn = document.querySelector('#english-btn');

const translate = () => {
    const lang = localStorage.getItem('lang') || 'ru';
    const elements = document.querySelectorAll('[data-i18n]');

    elements.forEach((el) => {
        const key = el.dataset.i18n
        el.innerText = lgConfig[lang][key];
    });
}

russianBtn.addEventListener('click', (e) => {
    e.preventDefault();
    localStorage.setItem('lang', 'ru');
    document.querySelector('.russian').style.display = 'none';
    document.querySelector('.english').style.display = 'block';
    translate()
});

englishBtn.addEventListener('click', (e) => {
    e.preventDefault();
    localStorage.setItem('lang', 'en');
    document.querySelector('.russian').style.display = 'block';
    document.querySelector('.english').style.display = 'none';
    translate()
});